In this Panda:
1.  String IO
2.  Pandas read_csv (comma,separated,values)

we will see how to read csv file

In [5]:
import pandas as pd
df = pd.read_csv('xyz.csv')     # Whenever a file e.g. CSV is read it converts to dataframe in python
                                # read_csv converts parameter passed into it to stringIO format 
                                # stringIO is an in memory file OBJECT which has many data
df

,Serial Number,Company Name,Employee Markme,Description,Leave
0,9788189999599,TALES OF SHIVA,Mark,mark,0
1,9780099578079,1Q84 THE COMPLETE TRILOGY,HARUKI MURAKAMI,Mark,0
2,9780198082897,MY KUMAN,Mark,Mark,0
3,9780007880331,THE GOD OF SMAAL THINGS,ARUNDHATI ROY,4TH HARPER COLLINS,2
4,9780545060455,THE BLACK CIRCLE,Mark,4TH HARPER COLLINS,0
...,...,...,...,...,...
94,9788184821536,MORE STORIES FROM THE JATAKAS,Mark,ACK,0
95,9788184821543,MORE TALES OF BIRBAL,-,ACK,0
96,9788184821550,TALES FROM THE JATAKAS,-,ACK,0
97,9788184821567,RAMarkS OF MEWAR,-,ACK,0
98,9788184821574,THE SONS OF THE PANDAVAS,-,ACK,0

In [6]:
type(df)

pandas.core.frame.DataFrame

In [54]:
# Now let us create a sample of csv in string, for this we need string io to convert our data to stringIO type
from io import StringIO
# from io import StringIO
data = ('Name,Age,Sex\n''Prabin,23,M\n''Robin,21,M\n''Abin,25,M\n')
print(type(data))
x = StringIO(data)      # in memory file format object, because read_csv requires file format type of data
print(type(x))
df = pd.read_csv(x)
df
# what I infer is that if I have a string data than i can convert it to file format and pass it as parameter to read_csv

<class 'str'>
<class '_io.StringIO'>

     Name  Age Sex
0  Prabin   23   M
1   Robin   21   M
2    Abin   25   M

In [ ]:
# Suppose i want to read a specific column only then use the paramenter:- usecols = ['Column Name']

In [56]:
# Suppose i want to convert my data to .csv file then
df.to_csv('pyCreatedCSV',index = False)  #this wll create csv file without index

In [60]:
# Can we specify datatype in CSV? Yes
data = ('a,b,c,d,e\n''1,2,3,4,5\n''6,7,8,9,2\n''7,8,9,2')
df = pd.read_csv(StringIO(data))
df

   a  b  c  d    e
0  1  2  3  4  5.0
1  6  7  8  9  2.0
2  7  8  9  2  NaN

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       3 non-null      int64
 4   e       2 non-null      float64
dtypes: float64(1), int64(4)
memory usage: 248.0 bytes

In [64]:
df = pd.read_csv(StringIO(data),dtype=object)  # here we are able to change datatype to object
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       3 non-null      object
 4   e       2 non-null      object
dtypes: object(5)
memory usage: 248.0+ bytes

In [74]:
# What if i want to assign different datatypes to different column: This we can do with dictionary
df = pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':int})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   b       3 non-null      float64
 2   c       3 non-null      int32
 3   d       3 non-null      int64
 4   e       2 non-null      float64
dtypes: float64(2), int32(2), int64(1)
memory usage: 224.0 bytes

In [76]:
df.dtypes

a      int32
b    float64
c      int32
d      int64
e    float64
dtype: object

In [66]:
df.isnull().sum()

a    0
b    0
c    0
d    0
e    1
dtype: int64

In [68]:
df

   a  b  c  d    e
0  1  2  3  4    5
1  6  7  8  9    2
2  7  8  9  2  NaN

In [70]:
# i want to get first eleement of first column
df['a'][0]

'1'

In [78]:
#Reading from path
pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item','\t') # we cna save it by .tocsv method

C:\Users\prabi\AppData\Local\Temp\ipykernel_21928\1865562583.py:2: FutureWarning: In a future version of pandas all arguments of read_csv except for the argument 'filepath_or_buffer' will be keyword-only.
  pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item','\t')

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359
...,...,...,...,...,...
395,SSEA011,College textbooks,3,T,314
396,SSEE041,Smartphones,4,T,335
397,SSFV031A,Food at elementary and secondary schools,3,T,122
398,SSGE013,Infants' equipment,3,T,356
399,SSHJ031,Infants' furniture,3,T,165